
# State **`s3://infrahouse-aws-control-289256138624/terraform.tfstate`**
## Affected resources counts

|   Success |    Add |   🟡 Change |    Destroy |
|----------:|-------:|------------:|-----------:|
|        ✅ |      0 |          11 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                |
|:--------:|:-----------------------------------------------------------------------------------------|
|    🟡    | `module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket`       |
|    🟡    | `module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_policy.state-bucke` |
|    🟡    | `module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket`       |
|    🟡    | `module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_policy.state-bucke` |
|    🟡    | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket`       |
|    🟡    | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_policy.state-bucke` |
|    🟡    | `module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket`       |
|    🟡    | `module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_policy.state-bucke` |
|    🟡    | `module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket`                  |
|    🟡    | `module.buckets["infrahouse-website-infra"].aws_s3_bucket_policy.state-bucke`            |
|    🟡    | `module.github-connector.aws_iam_openid_connect_provider.github`                         |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets["infrahouse-aws-control-289256138624"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-289256138624",
              + "arn:aws:s3:::infrahouse-aws-control-289256138624/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-289256138624"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
            "lock_table"        = "infrahouse-aws-control-289256138624-above-asp"
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            "repo"              = "infrahouse/aws-control-289256138624"
        }
      ~ tags_all                    = {
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_policy.state-bucke will be updated in-place
  ~ resource "aws_s3_bucket_policy" "state-bucke" {
        id     = "infrahouse-aws-control-289256138624"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-aws-control-289256138624/*",
                          - "arn:aws:s3:::infrahouse-aws-control-289256138624",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-303467602807",
              + "arn:aws:s3:::infrahouse-aws-control-303467602807/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-303467602807"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
            "lock_table"        = "infrahouse-aws-control-303467602807-alert-gecko"
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            "repo"              = "infrahouse/aws-control-303467602807"
        }
      ~ tags_all                    = {
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_policy.state-bucke will be updated in-place
  ~ resource "aws_s3_bucket_policy" "state-bucke" {
        id     = "infrahouse-aws-control-303467602807"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-aws-control-303467602807/*",
                          - "arn:aws:s3:::infrahouse-aws-control-303467602807",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-493370826424",
              + "arn:aws:s3:::infrahouse-aws-control-493370826424/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-493370826424"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
            "lock_table"        = "infrahouse-aws-control-493370826424-content-albacore"
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            "repo"              = "infrahouse/aws-control-493370826424"
        }
      ~ tags_all                    = {
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_policy.state-bucke will be updated in-place
  ~ resource "aws_s3_bucket_policy" "state-bucke" {
        id     = "infrahouse-aws-control-493370826424"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-aws-control-493370826424/*",
                          - "arn:aws:s3:::infrahouse-aws-control-493370826424",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-990466748045",
              + "arn:aws:s3:::infrahouse-aws-control-990466748045/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-990466748045"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
            "lock_table"        = "infrahouse-aws-control-990466748045-ultimate-hermit"
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            "repo"              = "infrahouse/aws-control"
        }
      ~ tags_all                    = {
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_policy.state-bucke will be updated in-place
  ~ resource "aws_s3_bucket_policy" "state-bucke" {
        id     = "infrahouse-aws-control-990466748045"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-aws-control-990466748045/*",
                          - "arn:aws:s3:::infrahouse-aws-control-990466748045",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.buckets["infrahouse-website-infra"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-website-infra",
              + "arn:aws:s3:::infrahouse-website-infra/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-website-infra"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
            "lock_table"        = "infrahouse-website-infra-well-pony"
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            "repo"              = "infrahouse/infrahouse-website-infra"
        }
      ~ tags_all                    = {
          ~ "module_version"    = "2.1.3" -> "2.2.0"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket_policy.state-bucke will be updated in-place
  ~ resource "aws_s3_bucket_policy" "state-bucke" {
        id     = "infrahouse-website-infra"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-website-infra/*",
                          - "arn:aws:s3:::infrahouse-website-infra",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.github-connector.aws_iam_openid_connect_provider.github will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "github" {
        id              = "arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com"
      ~ tags            = {
            "created_by_module" = "infrahouse/gh-identity-provider/aws"
          ~ "module_version"    = "1.0.3" -> "1.1.1"
        }
      ~ tags_all        = {
          ~ "module_version"    = "1.0.3" -> "1.1.1"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 11 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiAxMSwgImRlc3Ryb3kiOiAwfX0=
```
</details>